Lab-Journal-html/2026/06/week-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Journal Week 23</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='../../../style.css' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Journal Week 23</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org65d9647">Referencias</a></li>
<li><a href="#orgef63851">2026-06-01</a>
<ul>
<li><a href="#orgae47364">[09:14]</a></li>
<li><a href="#org92dc8da">[10:20]</a></li>
<li><a href="#orgbdccfcd">[12:25]</a></li>
<li><a href="#org789496e">[15:08]</a></li>
<li><a href="#org525a137">[15:13]</a></li>
<li><a href="#orga7a9c92">[15:17]</a></li>
</ul>
</li>
<li><a href="#orgc0fdb5d">2026-06-03</a>
<ul>
<li><a href="#orgf31da16">[09:28]</a></li>
<li><a href="#org4bb9685">[10:13]</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org65d9647" class="outline-2">
<h2 id="org65d9647">Referencias</h2>
<div class="outline-text-2" id="text-org65d9647">
<div class="csl-bib-body">
</div>
</div>
</div>
<div id="outline-container-orgef63851" class="outline-2">
<h2 id="orgef63851">2026-06-01</h2>
<div class="outline-text-2" id="text-orgef63851">
</div>
<div id="outline-container-orgae47364" class="outline-3">
<h3 id="orgae47364">[09:14]</h3>
<div class="outline-text-3" id="text-orgae47364">
<p>
Estuve probando con Claude intentar conectarme a la placa de adquisición de IOTech desde Linux. Le pase <code>DaqX64.dll</code> y los drivers <code>pdaq3k.sys</code> y <code>pdaq3kld.sys</code>.
</p>

<p>
Aparentemente Linux tiene un dirver generíco para comunicarse con la placa ya que <code>lsusb</code> la encuentra como un dispositivo de IOTech. Claude extrajo de los .sys el firmware de la placa y me dió un archivo de Python para comunicarnos pero de momento está en timeout. Recién me quedé sin tokens hasta las 13:30 pero luego jhabría que continuar probando. Durante el intento de carga del firmware interceptamos la comunicación con <code>tshark</code> y aparentemente le diálogo inicial tuvo éxito.
</p>
</div>
</div>
<div id="outline-container-org92dc8da" class="outline-3">
<h3 id="org92dc8da">[10:20]</h3>
<div class="outline-text-3" id="text-org92dc8da">
<p>
Ya estaría en general terminada la configuración literaria con <code>config.org</code>. Solo queda el tema de los ambientes virtuales de Python.
</p>
</div>
</div>
<div id="outline-container-orgbdccfcd" class="outline-3">
<h3 id="orgbdccfcd">[12:25]</h3>
<div class="outline-text-3" id="text-orgbdccfcd">
<p>
Ya está funcionando, con un ambiente llamado <code>~/.env</code>. Que usa por defecto <code>pyvenv</code>.
</p>
</div>
</div>
<div id="outline-container-org789496e" class="outline-3">
<h3 id="org789496e">[15:08]</h3>
<div class="outline-text-3" id="text-org789496e">
<p>
Ya tengo configurado también un modo con <code>f5</code> que interrumpe la ejecución y envía el aarchivo. El modo de output <code>%xmode</code>, al printear <code>KeyboardInterrup</code> viene por defecto en verboso y printea un montón de cosas, pero se podría cambiar. Además <code>f5</code> sólo funciona si hay algo que interrumpir, pero supongo que con un if se podría corregir también.
</p>
</div>
</div>
<div id="outline-container-org525a137" class="outline-3">
<h3 id="org525a137">[15:13]</h3>
<div class="outline-text-3" id="text-org525a137">
<p>
Queda para hacer de las mediciones del rompimiento de ola:
</p>
<ul class="org-ul">
<li>Calcular la distribución del número de Iribarren.</li>
<li>Superponer las partes repetidas y ver qué tan bien definida está la serie temporal.</li>
</ul>
</div>
</div>
<div id="outline-container-orga7a9c92" class="outline-3">
<h3 id="orga7a9c92">[15:17]</h3>
<div class="outline-text-3" id="text-orga7a9c92">
<p>
Hay una cosa rara con los tildes. Para replicar hay que apagara BloqMáyus e inmediatamenete tocar la tecla del tilde, esto lo que produce es que se ponga diérsis en vez de tilde, por ejemplo en &ldquo;Cömo&rdquo; en lugar de &ldquo;Cómo&rdquo;.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc0fdb5d" class="outline-2">
<h2 id="orgc0fdb5d">2026-06-03</h2>
<div class="outline-text-2" id="text-orgc0fdb5d">
</div>
<div id="outline-container-orgf31da16" class="outline-3">
<h3 id="orgf31da16">[09:28]</h3>
<div class="outline-text-3" id="text-orgf31da16">
<p>
Estoy descargando Wireshark en Mi Compu con Windows para poder registrar la comunicación de la placa con la computadora, en la búsqueda de poder utilizarla en Linux.
Para esto los pasos son:
</p>
<ol class="org-ol">
<li>Abrir Wireshark</li>
<li>Elegir USBP cap1, con la placa conectada, y seleccionar la placa.</li>
<li>Darle a <code>start</code> para iniciar la captura.</li>
<li>Desconectar y reconectar la placa, correr el código que le pregunta el nombre o lee un canal analógico.</li>
<li>Detenr la captura con <code>C-e</code> o el cuadrado rojo de arriba a la izquierda (al lado de la aleta de tiburón que permite reiniciar la captura).</li>
<li>Guardar la captura como <code>algo.pcapng</code>.</li>
</ol>
</div>
</div>
<div id="outline-container-org4bb9685" class="outline-3">
<h3 id="org4bb9685">[10:13]</h3>
<div class="outline-text-3" id="text-org4bb9685">
<p>
AL conectar hoy la placa en Linux tuve que cambiar la regla udev ya que se modificó el <i>ATTR{idProduct}==&ldquo;2c01&rdquo;</i>. ESto te das cuenta al correr <code>lsusb -v</code> y al ver el número 3 diría <code>can't open device</code> si cambió algo. AL corregir esto se soluciona.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
